{
  "schema": "v1",
  "blocks": [
    {
      "type": "heading",
      "text": "Lawsuits among Believers"
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 1 },
        {
          "kind": "t",
          "text": "If any of you has a grievance against another, how dare he go to law before the unrighteous instead of before the saints! "
        },
        { "kind": "v", "n": 2 },
        {
          "kind": "t",
          "text": "Do you not know that the saints will judge the world? And if you are to judge the world, are you not competent to judge trivial cases? "
        },
        { "kind": "v", "n": 3 },
        {
          "kind": "t",
          "text": "Do you not know that we will judge angels? How much more the things of this life!"
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 4 },
        {
          "kind": "t",
          "text": "So if you need to settle everyday matters, do you appoint as judges those of no standing in the church? "
        },
        { "kind": "v", "n": 5 },
        {
          "kind": "t",
          "text": "I say this to your shame. Is there really no one among you wise enough to arbitrate between his brothers? "
        },
        { "kind": "v", "n": 6 },
        {
          "kind": "t",
          "text": "Instead, one brother goes to law against another, and this in front of unbelievers!"
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 7 },
        {
          "kind": "t",
          "text": "The very fact that you have lawsuits among you means that you are thoroughly defeated already. Why not rather be wronged? Why not rather be cheated? "
        },
        { "kind": "v", "n": 8 },
        {
          "kind": "t",
          "text": "Instead, you yourselves cheat and do wrong, even against your own brothers!"
        }
      ]
    },
    {
      "type": "heading",
      "text": "Members of Christ"
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 9 },
        {
          "kind": "t",
          "text": "Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral, nor idolaters, nor adulterers, nor men who submit to or perform homosexual acts, "
        },
        { "kind": "v", "n": 10 },
        {
          "kind": "t",
          "text": "nor thieves, nor the greedy, nor drunkards, nor verbal abusers, nor swindlers, will inherit the kingdom of God. "
        },
        { "kind": "v", "n": 11 },
        {
          "kind": "t",
          "text": "And that is what some of you were. But you were washed, you were sanctified, you were justified, in the name of the Lord Jesus Christ and by the Spirit of our God."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 12 },
        {
          "kind": "t",
          "text": "\"Everything is permissible for me,\" but not everything is beneficial. \"Everything is permissible for me,\" but I will not be mastered by anything. "
        },
        { "kind": "v", "n": 13 },
        {
          "kind": "t",
          "text": "\"Food for the stomach and the stomach for food,\" but God will destroy them both. The body is not intended for sexual immorality, but for the Lord, and the Lord for the body. "
        },
        { "kind": "v", "n": 14 },
        {
          "kind": "t",
          "text": "By His power God raised the Lord from the dead, and He will raise us also."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 15 },
        {
          "kind": "t",
          "text": "Do you not know that your bodies are members of Christ? Shall I then take the members of Christ and unite them with a prostitute? Never! "
        },
        { "kind": "v", "n": 16 },
        {
          "kind": "t",
          "text": "Or don't you know that he who unites himself with a prostitute is one with her in body? For it is said, \"The two will become one flesh.\" "
        },
        { "kind": "v", "n": 17 },
        {
          "kind": "t",
          "text": "But he who unites himself with the Lord is one with Him in spirit."
        }
      ]
    },
    {
      "type": "heading",
      "text": "The Temple of the Holy Spirit"
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 18 },
        {
          "kind": "t",
          "text": "Flee from sexual immorality. Every other sin a man can commit is outside his body, but he who sins sexually sins against his own body. "
        },
        { "kind": "v", "n": 19 },
        {
          "kind": "t",
          "text": "Do you not know that your body is a temple of the Holy Spirit who is in you, whom you have received from God? You are not your own; "
        },
        { "kind": "v", "n": 20 },
        {
          "kind": "t",
          "text": "you were bought at a price. Therefore glorify God with your body."
        }
      ]
    }
  ]
}
