{
  "schema": "v1",
  "blocks": [
    {
      "type": "heading",
      "text": "Put On the New Self"
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 1 },
        {
          "kind": "t",
          "text": "Therefore, since you have been raised with Christ, strive for the things above, where Christ is seated at the right hand of God. "
        },
        { "kind": "v", "n": 2 },
        {
          "kind": "t",
          "text": "Set your minds on things above, not on earthly things. "
        },
        { "kind": "v", "n": 3 },
        {
          "kind": "t",
          "text": "For you died, and your life is now hidden with Christ in God. "
        },
        { "kind": "v", "n": 4 },
        {
          "kind": "t",
          "text": "When Christ, who is your life, appears, then you also will appear with Him in glory."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 5 },
        {
          "kind": "t",
          "text": "Put to death, therefore, the components of your earthly nature: sexual immorality, impurity, lust, evil desires, and greed, which is idolatry. "
        },
        { "kind": "v", "n": 6 },
        {
          "kind": "t",
          "text": "Because of these, the wrath of God is coming on the sons of disobedience. "
        },
        { "kind": "v", "n": 7 },
        {
          "kind": "t",
          "text": "When you lived among them, you also used to walk in these ways. "
        },
        { "kind": "v", "n": 8 },
        {
          "kind": "t",
          "text": "But now you must put aside all such things as these: anger, rage, malice, slander, and filthy language from your lips."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 9 },
        {
          "kind": "t",
          "text": "Do not lie to one another, since you have taken off the old self with its practices, "
        },
        { "kind": "v", "n": 10 },
        {
          "kind": "t",
          "text": "and have put on the new self, which is being renewed in knowledge in the image of its Creator. "
        },
        { "kind": "v", "n": 11 },
        {
          "kind": "t",
          "text": "Here there is no Greek or Jew, circumcised or uncircumcised, barbarian, Scythian, slave, or free, but Christ is all and is in all."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 12 },
        {
          "kind": "t",
          "text": "Therefore, as the elect of God, holy and beloved, clothe yourselves with hearts of compassion, kindness, humility, gentleness, and patience. "
        },
        { "kind": "v", "n": 13 },
        {
          "kind": "t",
          "text": "Bear with one another and forgive any complaint you may have against someone else. Forgive as the Lord forgave you. "
        },
        { "kind": "v", "n": 14 },
        {
          "kind": "t",
          "text": "And over all these virtues put on love, which is the bond of perfect unity. "
        },
        { "kind": "v", "n": 15 },
        {
          "kind": "t",
          "text": "Let the peace of Christ rule in your hearts, for to this you were called as members of one body. And be thankful."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 16 },
        {
          "kind": "t",
          "text": "Let the word of Christ richly dwell within you as you teach and admonish one another with all wisdom, and as you sing psalms, hymns, and spiritual songs with gratitude in your hearts to God. "
        },
        { "kind": "v", "n": 17 },
        {
          "kind": "t",
          "text": "And whatever you do, in word or deed, do it all in the name of the Lord Jesus, giving thanks to God the Father through Him."
        }
      ]
    },
    {
      "type": "heading",
      "text": "Christian Households"
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 18 },
        {
          "kind": "t",
          "text": "Wives, submit to your husbands, as is fitting in the Lord."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 19 },
        {
          "kind": "t",
          "text": "Husbands, love your wives and do not be harsh with them."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 20 },
        {
          "kind": "t",
          "text": "Children, obey your parents in everything, for this is pleasing to the Lord."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 21 },
        {
          "kind": "t",
          "text": "Fathers, do not provoke your children, so they will not become discouraged."
        }
      ]
    },
    {
      "type": "heading",
      "text": "Serving with Honor"
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 22 },
        {
          "kind": "t",
          "text": "Slaves, obey your earthly masters in everything, not only to please them while they are watching, but with sincerity of heart and fear of the Lord."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 23 },
        {
          "kind": "t",
          "text": "Whatever you do, work at it with your whole being, as for the Lord and not for men, "
        },
        { "kind": "v", "n": 24 },
        {
          "kind": "t",
          "text": "because you know that you will receive an inheritance from the Lord as your reward. It is the Lord Christ you are serving. "
        },
        { "kind": "v", "n": 25 },
        {
          "kind": "t",
          "text": "Whoever does wrong will be repaid for his wrong, and there is no favoritism."
        }
      ]
    }
  ]
}
