{
  "schema": "v1",
  "blocks": [
    {
      "type": "heading",
      "text": "Freedom in Christ"
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 1 },
        {
          "kind": "t",
          "text": "It is for freedom that Christ has set us free. Stand firm, then, and do not be encumbered once more by a yoke of slavery."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 2 },
        {
          "kind": "t",
          "text": "Take notice: I, Paul, tell you that if you let yourselves be circumcised, Christ will be of no value to you at all. "
        },
        { "kind": "v", "n": 3 },
        {
          "kind": "t",
          "text": "Again I testify to every man who gets himself circumcised that he is obligated to obey the whole law. "
        },
        { "kind": "v", "n": 4 },
        {
          "kind": "t",
          "text": "You who are trying to be justified by the law have been severed from Christ; you have fallen away from grace."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 5 },
        {
          "kind": "t",
          "text": "But by faith we eagerly await through the Spirit the hope of righteousness. "
        },
        { "kind": "v", "n": 6 },
        {
          "kind": "t",
          "text": "For in Christ Jesus neither circumcision nor uncircumcision has any value. What matters is faith expressing itself through love."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 7 },
        {
          "kind": "t",
          "text": "You were running so well. Who has obstructed you from obeying the truth? "
        },
        { "kind": "v", "n": 8 },
        {
          "kind": "t",
          "text": "Such persuasion does not come from the One who calls you. "
        },
        { "kind": "v", "n": 9 },
        {
          "kind": "t",
          "text": "A little leaven works through the whole batch of dough. "
        },
        { "kind": "v", "n": 10 },
        {
          "kind": "t",
          "text": "I am confident in the Lord that you will take no other view. The one who is troubling you will bear the judgment, whoever he may be."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 11 },
        {
          "kind": "t",
          "text": "Now, brothers, if I am still preaching circumcision, why am I still being persecuted? In that case the offense of the cross has been abolished. "
        },
        { "kind": "v", "n": 12 },
        {
          "kind": "t",
          "text": "As for those who are agitating you, I wish they would proceed to emasculate themselves!"
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 13 },
        {
          "kind": "t",
          "text": "For you, brothers, were called to freedom; but do not use your freedom as an opportunity for the flesh. Rather, serve one another in love. "
        },
        { "kind": "v", "n": 14 },
        {
          "kind": "t",
          "text": "The entire law is fulfilled in a single decree: \"Love your neighbor as yourself.\" "
        },
        { "kind": "v", "n": 15 },
        {
          "kind": "t",
          "text": "But if you keep on biting and devouring one another, watch out, or you will be consumed by one another."
        }
      ]
    },
    {
      "type": "heading",
      "text": "Walking by the Spirit"
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 16 },
        {
          "kind": "t",
          "text": "So I say, walk by the Spirit, and you will not gratify the desires of the flesh. "
        },
        { "kind": "v", "n": 17 },
        {
          "kind": "t",
          "text": "For the flesh craves what is contrary to the Spirit, and the Spirit what is contrary to the flesh. They are opposed to each other, so that you do not do what you want. "
        },
        { "kind": "v", "n": 18 },
        {
          "kind": "t",
          "text": "But if you are led by the Spirit, you are not under the law."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 19 },
        {
          "kind": "t",
          "text": "The acts of the flesh are obvious: sexual immorality, impurity, and debauchery; "
        },
        { "kind": "v", "n": 20 },
        {
          "kind": "t",
          "text": "idolatry and sorcery; hatred, discord, jealousy, and rage; rivalries, divisions, factions, "
        },
        { "kind": "v", "n": 21 },
        {
          "kind": "t",
          "text": "and envy; drunkenness, orgies, and the like. I warn you, as I did before, that those who practice such things will not inherit the kingdom of God."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 22 },
        {
          "kind": "t",
          "text": "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, "
        },
        { "kind": "v", "n": 23 },
        {
          "kind": "t",
          "text": "gentleness, and self-control. Against such things there is no law."
        }
      ]
    },
    {
      "type": "para",
      "segments": [
        { "kind": "v", "n": 24 },
        {
          "kind": "t",
          "text": "Those who belong to Christ Jesus have crucified the flesh with its passions and desires. "
        },
        { "kind": "v", "n": 25 },
        {
          "kind": "t",
          "text": "Since we live by the Spirit, let us walk in step with the Spirit. "
        },
        { "kind": "v", "n": 26 },
        {
          "kind": "t",
          "text": "Let us not become conceited, provoking and envying one another."
        }
      ]
    }
  ]
}
